# helper for strings

class Helper(object):
    HELP_M = '''اختار القسم اللي محتاج فيه مساعدة.
لو عندك سؤال اسأل في جروب الدعم 🤍

كل الأوامر بتبدأ بـ : /'''

    HELP_ChatGPT = '''الذكاء الاصطناعي

أوامر ChatGPT:

/ask ➠ اسأل الذكاء الاصطناعي وهيجاوبك على أي سؤال ✨.'''

    HELP_Reel = '''التحميلات

أوامر التحميل:

/ig [رابط] ➠ تحميل ريلز إنستجرام.
/instagram [رابط] ➠ تحميل ريلز إنستجرام.
/reel [رابط] ➠ تحميل ريلز إنستجرام 🧚.'''

    HELP_TagAll = '''المنشن (Tag)

أوامر المنشن في الجروب:

๏ /tagall ➛ منشن جماعي عشوائي.
لإيقاف التاج ⇴ /tagoff أو /tagstop.

๏ /gmtag ➛ منشن "صباح الخير".
إيقاف التاج ⇴ /gmstop ✨.

๏ /gntag ➛ منشن "تصبح على خير".
إيقاف التاج ⇴ /gnstop.

๏ /hitag ➛ منشن رسايل هندي عشوائية.
إيقاف التاج ⇴ /histop.

๏ /shayari ➛ منشن "شعر" عشوائي.
إيقاف التاج ⇴ /shstop.

๏ /utag ➛ منشن لأي نص تكتبه.
إيقاف التاج ⇴ /cancel 🥀.'''

    HELP_Info = '''المعلومات

أوامر المعلومات:

/id : لمعرفة أيدي الجروب، أو أيدي الشخص بالرد عليه.
/info : لعرض معلومات المستخدم 🤍.'''

    HELP_History = '''السجل (History)

أوامر سجل الرسائل:

⦿ /sg أو /History
الوصف:
⦿ بيجيب رسالة عشوائية من سجل رسايل المستخدم ✨.

الاستخدام:
⦿ /sg [يوزر / أيدي / ريبلاي]

التفاصيل:
⦿ متاح فقط لمساعدين البوت.
⦿ بيجيب رسالة عشوائية من سجل الشخص المحدد.

أمثلة:
⦿ /sg username
⦿ /sg user_id
⦿ /sg [بالرد على رسالة]'''

    HELP_Couples = '''الكابلز (Couples)

أوامر الكابلز:

/couples - بيختار شخصين عشوائي كأفضل كابل لليوم 💖.'''

    HELP_Extra = '''إضافات

أوامر إضافية:

⦿ /tgm ➠ ارفع صورة وخد رابط ليها.
⦿ /paste ➠ ارفع نص وخد رابط ليه.
⦿ /tr ➠ مترجم النصوص 🧚.'''

    HELP_Action = '''الإشراف (Admin)

أوامر الحظر والكتم 🥀:

 ❍ /kickme: طرد نفسك من الجروب.

للمشرفين فقط:
 ❍ /ban : حظر مستخدم.
 ❍ /sban : حظر صامت (بدون رد).
 ❍ /tban : حظر مؤقت بوقت محدد.
 ❍ /unban : فك حظر مستخدم.
 ❍ /kick : طرد مستخدم.
 ❍ /mute : كتم مستخدم.
 ❍ /tmute : كتم مؤقت بوقت محدد.
 ❍ /unmute : فك كتم مستخدم ✨.
__
دعم خاص للأوامر (مثال):
Branded ban, Branded mute, Branded promote ..... إلخ'''

    HELP_Search = '''البحث

أوامر البحث:

• /google <بحث> : البحث في جوجل.
• /image (/imgs) <بحث> : البحث عن صور 🤍.

مثال:
/google pyrogram: بيجيب أول 5 نتائج.'''

    HELP_Font = '''الخطوط

تغيير شكل الخط:

◌ /font [النص] ✨'''

    HELP_Bots = '''البوتات

قائمة البوتات:

◌ /bots - عرض قائمة البوتات الموجودة في الجروب 🧚.'''

    HELP_TG = '''تليجراف

أوامر ميديا تليجراف:

تحويل أي ميديا لرابط تليجراف:

◌ /tgm [بالرد على الميديا]
◌ /tgt [بالرد على الميديا] 🤍'''

    HELP_Source = '''السورس

أوامر سورس البوت:

◌ /repo : الحصول على رابط سورس البوت ✨.'''

    HELP_TD = '''صراحة أو جرأة

أوامر اللعبة:

◌ /truth : سؤال صراحة عشوائي.
◌ /dare : تحدي جرأة عشوائي 🧚.'''

    HELP_Quiz = '''الاختبارات

سؤال وجواب:

◌ /quiz - الحصول على سؤال اختبار عشوائي ✨.'''

    HELP_TTS = '''تحويل النص لصوت

أوامر TTS:

◌ /tts : [النص] 🤍
◌ الاستخدام ➛ تحويل الكلام المكتوب لمقطع صوتي.'''

    HELP_Radio = '''الراديو

تشغيل الراديو:

◌ /radio - لتشغيل الراديو في المحادثة الصوتية 🧚.'''

    HELP_Q = '''كوتلي (Quotly)

أوامر الملصقات:

◌ /q : تحويل الرسالة لملصق.
◌ /q r : تحويل الرسالة مع الرد لملصق ✨.'''
    
    
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
}

    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
}
