from BrandrdXMusic import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " **※ بحبك يا صرصار قلبي...ᰔᩚ**",
           " **※ انساني وقطع ورقتي..ᰔᩚ",
           " **※ مش بحبك ولا هحبك...ᰔᩚ**",
           " **※ خلاص بقيت بتاعي يا بيبي...ᰔᩚ**",
           " **※ تعال نورني في جروبي كمان...ᰔᩚ**",
           " **※ اسمك محفور في قلبي من جوه...ᰔᩚ**",
           " **※ هما صحابك راحوا فين يا بطل...ᰔᩚ**",
           " **※ سرحان في مين يا جميل...ᰔᩚ**",
           " **※ شغال إيه بقى في دنيتك دي...ᰔᩚ**",
           " **※ ساكن فين يا قمر...ᰔᩚ**",
           " **※ صباح الورد والياسمين يا بيبي...ᰔᩚ**",
           " **※ تصبح على خير، نام بقى الدنيا ليل...ᰔᩚ**",
           " **※ مخنوق شوية النهاردة...ᰔᩚ**",
           " **※ ما تيجي ندردش شوية...ᰔᩚ**",
           " **※ هنتعشى إيه النهاردة يا وحش...ᰔᩚ**",
           " **※ الدنيا عاملة معاك إيه...ᰔᩚ**",
           " **※ مبتبعش رسايل ليه يا قاسي...ᰔᩚ**",
           " **※ أنا غلبان والله...ᰔᩚ**",
           " **※ اليوم بتاع امبارح كان جامد صح...ᰔᩚ**",
           " **※ كنت فين امبارح يا شقي...ᰔᩚ**",
           " **※ مالك ساكت كدة ليه يا صاحبي...ᰔᩚ**",
           " **※ بتعرف تغني؟ طب سمعنا حاجة...ᰔᩚ**",
           " **※ ما تيجي نتمشى شوية...ᰔᩚ**",
           " **※ خليك دايما مروق يا زميلي...ᰔᩚ**",
           " **※ ينفع نكون صحاب...ᰔᩚ**",
           " **※ إنت متجوز ولا لسة...ᰔᩚ**",
           " **※ غايب فين كل ده يا فنان...ᰔᩚ**",
           " **※ اللينك في البايو، ادخل بسرعة...ᰔᩚ**",
           " **※ والله كانت سهرة زي العسل...ᰔᩚ**",
           " **※ تعرف مين صاحب الجروب ده...ᰔᩚ**",
           " **※ بتفكر فيا زي ما بفكر فيك...ᰔᩚ**",
           " **※ يلا بينا نـهيص...ᰔᩚ**",
           " **※ نورتنا النهاردة يا نجم...ᰔᩚ**",
           " **※ اسمع مني الكلمتين دول...ᰔᩚ**",
           " **※ يومك كان عامل إيه...ᰔᩚ**",
           " **※ شوفت اللي حصل...ᰔᩚ**",
           " **※ إنت أدمن هنا ولا ضيف...ᰔᩚ**",
           " **※ مرتبط ولا سنجل بائس...ᰔᩚ**",
           " **※ الدنيا ماشية معاك إزاي...ᰔᩚ**",
           " **※ لمحتك امبارح خلي بالك...ᰔᩚ**",
           " **※ إنت منين يا غالي...ᰔᩚ**",
           " **※ أونلاين وبتنفض صح...ᰔᩚ**",
           " **※ بتحب تاكل إيه...ᰔᩚ**",
           " **※ ضيفني في جروبك وهروقك أغاني ومنشن...ᰔᩚ**",
           " **※ تلعب صراحة ولا جرأة...ᰔᩚ**",
           " **※ مالك شكلك زعلان ليه...ᰔᩚ**",
           " **※ تاخد حتة شوكولاتة...ᰔᩚ**",
           " **※ أهلا يا بيبي...ᰔᩚ**",
           " **※ فكك من السكوت وكلمني...ᰔᩚ**",
           " **※ قولت إيه في الموضوع ده...ᰔᩚ**",
           " **※ هات رقمك الواتساب طيب...ᰔᩚ**"
           ]

VC_TAG = [ " **⚘ انساني وروح لحالك...💥**",
         " **⚘ مش طايقك النهاردة...💥**",
         " **⚘ إنت ملكي لوحدي...💥**",
         " **⚘ نورنا في الجروب التاني...💥**",
         " **⚘ صورتك مش بتفارق خيالي...💥**",
         " **⚘ الناس راحت فين يا جدعان...💥**",
         " **⚘ تايه في مين يا قلبي...💥**",
         " **⚘ بتشتغل إيه يا وحش...💥**",
         " **⚘ بلدك إيه يا غالي...💥**",
         " **⚘ يا صباح الفل والجمال...💥**",
         " **⚘ تصبح على خير يا قمر...💥**",
         " **⚘ قلبي مقبوض النهاردة مش عارف ليه...💥**",
         " **⚘ عبرني يا عم وكلمني...💥**",
         " **⚘ هناكل إيه النهاردة...💥**",
         " **⚘ إيه الأخبار يا بطل...💥**",
         " **⚘ مفيش رسايل خالص كدة...💥**",
         " **⚘ أنا أطيب خلق الله...💥**",
         " **⚘ كانت خروجة فاجرة صح...💥**",
         " **⚘ كنت غطسان فين امبارح...💥**",
         " **⚘ في حب جديد ولا إيه...💥**",
         " **⚘ السكوت ده وراه سر كبير...💥**",
         " **⚘ صوتك كروان، سمعنا حاجة...💥**",
         " **⚘ تخرج معايا النهاردة...💥**",
         " **⚘ يا رب دايما تضحك يا صاحبي...💥**",
         " **⚘ نكون صحاب قشطة...💥**",
         " **⚘ متجوز ولا لسة بتدور...💥**",
         " **⚘ كنت فين يا فنان كل ده...💥**",
         " **⚘ اللينك عندك أهو، ادخل نورنا...💥**",
         " **※ بهزر معاك يا عم...💥**",
         " **⚘ تعرف الباشا صاحب المكان...💥**",
         " **⚘ فاكرني ولا خلاص نسيت...💥**",
         " **⚘ يلا نولعها...💥**",
         " **⚘ جيت إمتى يا نجم...💥**",
         " **⚘ يومك كان لذيذ...💥**",
         " **⚘ شوفت المفاجأة دي...💥**",
         " **⚘ إنت الأدمن هنا...💥**",
         " **⚘ نكون صحاب أحسن...💥**",
         " **⚘ إيه الكلام يا بطل...💥**",
         " **⚘ عامل إيه في دنيتك...💥**",
         " **⚘ شوفتك امبارح يا شقي...💥**",
         " **⚘ أصلك منين...💥**",
         " **⚘ متاح ندردش دلوقتي...💥**",
         " **⚘ إنت صاحبي بجد...💥**",
         " **⚘ أكلتك المفضلة إيه...💥**",
         " **⚘ ضيفني عندك وهظبطلك الدنيا...💥**",
         " **⚘ حزين النهاردة شوية...💥**",
         " **⚘ تلعب صراحة...💥**",
         " **⚘ طول ما إنت معايا الدنيا بخير...💥**",
         " **⚘ حصلك إيه يا بطل...💥**",
         " **⚘ تاكل شوكولاتة...💥**",
         " **⚘ أهلا يا عسلي...💥**",
         " **⚘ دردش معايا وفكك...💥**",
         " **⚘ رأيك إيه بقا...💥**"
        ]


@app.on_message(filters.command(["entag", "englishtag" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ الأمر ده للمجموعات بس يا نجم.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ إنت مش أدمن يا جميل، المنشن للمشرفين بس. ")

    if message.reply_to_message and message.text:
        return await message.reply("اكتب الأمر كدة: /entag + الكلمة، أو رد على أي رسالة.")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("رد على رسالة عشان أبدأ منشن...")
    else:
        return await message.reply("اكتب الأمر كدة: /entag + الكلمة، أو رد على أي رسالة.")
    if chat_id in spam_chats:
        return await message.reply("๏ وقف المنشن اللي شغال الأول يا غالي...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


@app.on_message(filters.command(["bntag"], prefixes=["/", "@", "#"]))
async def mention_allvc(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ الأمر ده للمجموعات بس يا نجم.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ إنت مش أدمن يا جميل، المنشن للمشرفين بس. ")
    if chat_id in spam_chats:
        return await message.reply("๏ وقف المنشن اللي شغال الأول يا غالي...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            txt = f"{usrtxt} {random.choice(VC_TAG)}"
            await client.send_message(chat_id, txt)
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass



@app.on_message(filters.command(["cancel", "enstop", "bnstop"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("๏ مفيش منشن شغال دلوقتي أصلاً يا بيبي.")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ الأمر ده للأدمن بس، إنت ملكش دعوة.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("๏ خلاص وقفت المنشن أهو ๏")
