from BrandrdXMusic import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " **❅ يا بيبي إنت فين؟ 🤗** ",
           " **❅ أوي.. نمت ولا إيه؟ ادخل أونلاين بقا 😊** ",
           " **❅ ما تفتح كول خلينا ندردش شوية 😃** ",
           " **❅ أكلت ولا لسة يا بطل؟ 🥲** ",
           " **❅ أخبار أهلك والبيت إيه؟ 🥺** ",
           " **❅ تعرف إنك واحشني جداً؟ 🤭** ",
           " **❅ قولي بقا عامل إيه في دنيتك..؟؟ 🤨** ",
           " **❅ عرفني على ناس جديدة طيب..؟؟ 🙂** ",
           " **❅ اسمك الحقيقي إيه يا قمر..؟؟ 🥲** ",
           " **❅ فطرت ولا لسة يا وحش..?? 😋** ",
           " **❅ ضيفني في جروبك وهظبطلك الكلام 😍** ",
           " **❅ صاحبك بينادي عليك، عبره يا عم 😅** ",
           " **❅ إنت مرتبط ولا سنجل بائس زينا..؟؟ 🤔** ",
           " **❅ روحت تنام وسيبتنا؟ 🙄** ",
           " **❅ الدنيا حر أوي، حد يشغل مروحة 😕** ",
           " **❅ بلدك إيه يا غالي..؟؟ 🙃** ",
           " **❅ أهلا يا بطل، عامل إيه؟ 😛** ",
           " **❅ بتعمل إيه يا شقي دلوقتي؟ 🤔** ",
           " **❅ تعرفني ولا لسة جديد هنا؟ ☺️** ",
           " **❅ تيجي نلعب لودو ونسلي وقتنا؟ 🤗** ",
           " **❅ يومك النهاردة كان عامل إزاي؟ 😇** ",
           " **❅ بابا وماما عاملين إيه؟ 🤭** ",
           " **❅ ما تيجي نخرج ناكل أكلة حلوة 🥺** ",
           " **❅ خلي بالك من نفسك، الجو برا زحمة 😶** ",
           " **❅ طمني عليك، أخبارك إيه؟ 🤔** ",
           " **❅ صباح الفل والورد 😜** ",
           " **❅ ممكن تخدمني خدمة بسيطة؟ 🙂** ",
           " **❅ شغلنا أغنية حلوة كدة على زوقك 😪** ",
           " **❅ فرصة سعيدة يا نجم ☺** ",
           " **❅ كلت ولا لسة يا روحي؟ 🙊** ",
           " **❅ المذاكرة والدروس عاملة معاك إيه؟ 😺** ",
           " **❅ الدنيا بقت تفتح النفس بوجودك 🥲** ",
           " **❅ منور المكان والله يا غالي 😅** ",
           " **❅ اضحك كدة خلي الصورة تطلع حلوة 😅** ",
           " **❅ اقفل الموبايل بقا عشان متتعبش 😆** ",
           " **❅ عرفنا على صحابك الجداد 😉** ",
           " **❅ إنت شخص زي العسل بجد 💚** ",
           " **❅ أنا بحب وجودك في الجروب والله 👀** ",
           " **❅ خليك دايما مروق يا زميلي 🙉** ",
           " **❅ أقولك نكتة وتضحك؟ 😹** ",
           " **❅ افتح الكول خلينا نسمع صوتك 😻** ",
           " **❅ عندك انستجرام ولا فكك منه؟ 🙃** ",
           " **❅ ابعتلي رقمك الواتساب طيب 😕** ",
           " **❅ صحابك شكلهم ناس محترمة زيك 🙃** ",
           " **❅ لو خلصت اللي وراك، تعال دردش معانا 🙃** ",
           " **❅ نورت الجروب يا غالي 😊** ",
           " **❅ خليك دايما واثق في نفسك 🥺** ",
           " **❅ ساعدنا وضيف ناس للجروب عشان نكبر ♥️** ",
           " **❅ أنا زعلان منك عشان مش بتسأل 😠** ",
           " **❅ العيلة كلها بخير يا رب؟ ❤** ",
           " **❅ حصل إيه طمني؟ 🤔** ",
           " **❅ وحشتني رسايلك الجميلة 😒** ",
           " **❅ نسيتني خلاص يا قاسي؟ 😏** ",
           " **❅ ليه كدة بس؟ خليك صريح 🤐** ",
           " **❅ فكها كدة وابتسم الدنيا مش محتاجة 😒** ",
           " **❅ كل ده برستيج علينا يا عم؟ 😮** ",
           " **❅ يا هلو، غطسان فين؟ 👀** ",
           " **❅ أنا مبسوط أوي إن عندي صاحب زيك 🙈** ",
           " **❅ مودي مش أوي النهاردة ☹️** ",
           " **❅ عبرني يا عم وكلمني شوية 🥺** ",
           " **❅ طبختوا إيه النهاردة؟ 👀** ",
           " **❅ إيه الكلام الجديد؟ 🙂** ",
           " **❅ مختفي فين يا بطل؟ 🥺** ",
           " **❅ أنا غلبان والله ومسالم 🥺** ",
           " **❅ سهرة امبارح كانت تحفة 😅** ",
           " **❅ كنت مشغول في إيه امبارح؟ 😕** ",
           " **❅ حياتك عاملة إيه الأيام دي؟ 👀** ",
           " **❅ مالك هادي كدة ليه يا فنان؟ 😼** ",
           " **❅ صوتك حلو؟ طب سمعنا حاجة 😸** ",
           " **❅ تخرج معايا خروجة سريعة؟ 🙈** ",
           " **❅ خليك دايما مروق يا وحش 🤞** ",
           " **❅ ينفع نكون صحاب بجد؟ 🥰** ",
           " **❅ الدنيا معاك تمام؟ 🥺** ",
           " **❅ غايب فين كل ده؟ 🥲** ",
           " **❅ مرتبط ولا لسة بتدور؟ 😉** ",
           " **❅ يلا بينا نـهيص شوية 🥳** ",
           " **❅ شرفنا في جروبنا التاني 🧐** ",
           " **❅ أنا مش بحب النكد خالص 🥺** ",
           " **❅ نورت الدنيا يا غالي 🤭** ",
           " **❅ افتكرني دايما بالخير 😊** ",
           " **❅ خليك دايما سندي وصاحبي 🥺** ",
           " **❅ نورنا في الجروب بوجودك 🤗** ",
           " **❅ اسمك محفور في القلب 😗** ",
           " **❅ فين الناس اللي كانت هنا؟ 🥺** ",
           " **❅ منور المكان يا صاحب البوت 🥰** ",
           " **❅ سرحان في مين يا جميل؟ 😜** ",
           " **❅ تصبح على خير، الوقت سرقنا 🥰** ",
           ]

VC_TAG = [ "**❅ لو مخدتش خطوة النهاردة، هتفضل مكانك.**",
         "**❅ الحياة صعبة بس مفيش مستحيل.**",
         "**❅ الدنيا أقصر من إننا نقضيها خناق.**",
         "**❅ متستناش اللحظة المناسبة، اصنعها بنفسك.**",
         "**❅ السكوت ساعات بيبقى أحسن رد.**",
         "**❅ كل يوم جديد هو فرصة تانية.**",
         "**❅ غير أولوياتك عشان تغير حياتك.**",
         "**❅ الحياة رحلة مش سباق، استمتع بيها.**",
         "**❅ اضحك ومتقلقش، بكرة أحلى.**",
         "**❅ متبصش لغيرك، ركز في نجاحك إنت.**",
         "**❅ أنا بشتغل على نفسي عشان أكون أحسن.**",
         "**❅ الحياة زي الأيس كريم، استمتع بيها قبل ما تسيح.**",
         "**❅ خليك حر زي الطير في السما.**",
         "**❅ إنت المسؤول عن حياتك بنسبة مية في المية.**",
         "**❅ بكرة دايما فيه فرصة جديدة.**",
         "**❅ النجاح بيبدأ من بره منطقة الراحة بتاعتك.**",
         "**❅ الوجع اللي مش بيموتك بيقويك.**",
         "**❅ الحياة زي الكاميرا، اضحكلها عشان تطلع حلوة.**",
         "**❅ 10% اللي بيحصلك و 90% رد فعلك عليه.**",
         "**❅ خليك دايما متفائل باللي جاي.**",
         "**❅ مفيش حد هينقذك غير نفسك.**",
         "**❅ الحياة محتاجة مجهود وصبر.**",
         "**❅ الدنيا مغامرة كبيرة، عيشها صح.**",
         "**❅ الأمل هو اللي بيخلينا نكمل.**",
         "**❅ عيش الواقع بلاش تعيش في الأوهام.**",
         "**❅ قوم وغير حياتك، محدش هيعملك حاجة.**",
         "**❅ ثق في نفسك وهتعرف تعيش صح.**",
         "**❅ صحتك هي أهم حاجة عندك.**",
         "**❅ الوقت بيغير كل حاجة.**",
         "**❅ فكر صح تعيش صح.**",
         "**❅ خليك مع الناس اللي بتطلع أحسن ما فيك.**",
         "**❅ أفكارك هي اللي بتصنع واقعك.**",
         "**❅ الناس بتروح بس الذكريات بتفضل.**",
         "**❅ حياتنا هي نتاج تفكيرنا.**",
         "**❅ القلب الأبيض بيعيش أطول.**",
         "**❅ بلاش تعود نفسك على الحزن.**",
         "**❅ الحياة هدية، حافظ عليها.**",
         "**❅ مشاعرك هي اللي بتحركك.**",
         "**❅ التجارب بتبان على ملامح الوش.**",
         "**❅ الحياة شوية ضحك وشوية تعب.**",
         "**❅ القيمة في الحياة الكويسة مش بس في العمر.**",
         "**❅ غير قلبك، حياتك هتتغير معاك.**",
         "**❅ الحياة ملهاش طعم من غير صحاب بجد.**",
         "**❅ لو كنت شجاع في الوداع، بكرة هيعوضك بلقاء أحلى.**",
         "**❅ مفيش أغلى من الناس اللي بتحبنا.**",
         "**❅ تقدر تعمل حاجات كتير، بس ركز في الأهم.**",
         "**❅ الحياة بتبقى أسهل لما بتبقى أقوى.**",
         "**❅ حياتي مش كاملة بس فيها لحظات تجنن.**",
         "**❅ سيبها على الله وهتتحل.**",
         "**❅ أفكارك هي اللي بتحدد طريقك.**",
         "**❅ الدنيا محطات ورا بعضها.**",
         "**❅ الحياة محاربة مش استسلام.**",
         "**❅ الدنيا عاملة زي الجبل، محتاجة عفر عشان توصل.**",
         "**❅ أصعب حاجة في الحياة إنها بتعدي بسرعة.**",
         "**❅ الحياة بسيطة لو إحنا بسطناها.**",
         "**❅ فكر مرتين قبل ما تتكلم مرة.**",
         "**❅ إحنا اللي بنعقد الدنيا وهي سهلة.**",
         "**❅ الحياة قصيرة أوي، استغلها صح.**",
         "**❅ سر السعادة إن توقعاتك تكون قليلة.**",
         "**❅ الدنيا مدرسة وكل يوم بنتعلم جديد.**",
         "**❅ مفيش حاجة دايمة، كلو بيعدي.**",
         "**❅ الوقت الحلو بيمر بسرعة.**",
         "**❅ الدنيا حلوة لو عرفت تبص للجانب الصح.**",
         "**❅ الحياة أحلى وإنت جنبي.**",
         "**❅ مفيش حياة من غير حب.**",
         "**❅ الحياة كلها تعب ومحاولات.**",
         "**❅ الرضا بيخلي القليل كتير.**",
         "**❅ الحياة 10% فعل و 90% فهم للفعل ده.**",
         "**❅ لسة فيه حاجات كتير حلوة مشوفناهاش.**",
         "**❅ مفيش حاجة بتبقى سهلة، إنت اللي بتبقى أقوى.**",
         "**❅ عيش، اضحك، وفكها.**",
         "**❅ كل واحد بيجي يومه، عيش يومك بقا.**",
        ]


@app.on_message(filters.command(["hitag" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ الأمر ده للمجموعات بس يا نجم.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ إنت مش أدمن يا جميل، المنشن للمشرفين بس. ")

    if message.reply_to_message and message.text:
        return await message.reply("اكتب الأمر كدة: /hitag + الكلمة، أو رد على أي رسالة.")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("رد على أي رسالة عشان أبدأ منشن...")
    else:
        return await message.reply("اكتب الأمر كدة: /hitag + الكلمة، أو رد على أي رسالة.")
    if chat_id in spam_chats:
        return await message.reply("๏ وقف المنشن اللي شغال الأول يا غالي...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


@app.on_message(filters.command(["lifetag"], prefixes=["/", "@", "#"]))
async def mention_allvc(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ الأمر ده للمجموعات بس يا نجم.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ إنت مش أدمن يا جميل، المنشن للمشرفين بس. ")
    if chat_id in spam_chats:
        return await message.reply("๏ وقف المنشن اللي شغال الأول يا غالي...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            txt = f"{usrtxt} {random.choice(VC_TAG)}"
            await client.send_message(chat_id, txt)
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass



@app.on_message(filters.command(["cancel", "histop", "lifestop"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("๏ مفيش منشن شغال دلوقتي أصلاً يا بيبي.")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ الأمر ده للأدمن بس، إنت ملكش دعوة.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("๏ خلاص وقفت المنشن أهو ๏")
